# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10  # number of classes

scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
#   # [depth, width, max_channels]
#   n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
#    s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
#   m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
#   l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
   x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs
fusion_mode: concat
node_mode: C2f
head_channel: 256


# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 1]]  # 0-P1/2
  - [-1, 1, space_to_depth, [1]]  # 1 -P2/4
  - [-1, 3, C2f, [64, True]]   #2
  - [-1, 1, Conv, [128, 3, 1]]  # 3-P2/4
  - [-1, 1, space_to_depth, [1]]  # 4 -P2/4
  - [-1, 3, C2f, [128, True]]   #5
  - [-1, 1, Conv, [256, 3, 1]]  # 6   -P3/8
  - [-1, 1, space_to_depth, [1]]  # 7 -P2/4
  - [-1, 6, C2f, [256, True]]   #8
  - [-1, 1, Conv, [512, 3, 1]]  # 9-P4/16
  - [-1, 1, space_to_depth, [1]]  # 10 -P2/4
  - [-1, 6, C2f, [512, True]]   #11
  - [-1, 1, Conv, [1024, 3, 1]]  # 12
  - [-1, 1, space_to_depth, [1]]  # 13
  - [-1, 3, C2f, [1024, True]]  #14
  - [-1, 1, SPPF, [1024, 5]]  # 15


head:
  - [4, 1, Conv, [head_channel]]  # 16-P3/8
  - [7, 1, Conv, [head_channel]]  # 17-P4/16
  - [10, 1, Conv, [head_channel]]  # 18-P5/32
  - [15, 1, Conv, [head_channel]]  # 19  -P5/32

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15 P5->P4  20
  - [[-1, 18], 1, Fusion, [fusion_mode]] # 21
  - [-1, 3, node_mode, [head_channel]] #    22
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #  23
  - [[-1, 17], 1, Fusion, [fusion_mode]] # 24
  - [-1, 3, node_mode, [head_channel]] #  25

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 26
  - [[-1, 16], 1, Fusion, [fusion_mode]] # 27
  - [-1, 3, node_mode, [head_channel]] # 18-P3/8  28

  - [1, 1, Conv, [head_channel, 3, 1]] # 29
  - [-1, 1, space_to_depth, [1]]  # 30
  - [[-1, 16, 28], 1, Fusion, [fusion_mode]] # 31
  - [-1, 3, node_mode, [head_channel]] # 32
  - [-1, 1, MultiSEAM, [512, 1, 3, [6, 7, 8], 8]]# 33

  - [-1, 1, Conv, [head_channel, 3, 1]] #  34
  - [-1, 1, space_to_depth, [1]]  # 35
  - [[-1, 17, 25], 1, Fusion, [fusion_mode]] # 36
  - [-1, 3, node_mode, [head_channel]] #     37
  - [-1, 1, MultiSEAM, [512, 1, 3, [6, 7, 8], 8]]     #38

  - [-1, 1, Conv, [head_channel, 3, 1]] # 39
  - [-1, 1, space_to_depth, [1]]  # 40
  - [[-1, 18, 22], 1, Fusion, [fusion_mode]] #   41
  - [-1, 3, node_mode, [head_channel]] # 24-P4/16   42 
  - [-1, 1, MultiSEAM, [512, 1, 3, [6, 7, 8], 8]]# 43

  - [-1, 1, Conv, [head_channel, 3, 1]] # 44
  - [-1, 1, space_to_depth, [1]]  #   45
  - [[-1, 19], 1, Fusion, [fusion_mode]] # 46
  - [-1, 3, node_mode, [head_channel]] # 47
  - [-1, 1, MultiSEAM, [512, 1, 3, [6, 7, 8], 8]]    #48

  - [[33, 38, 43,48], 1, Detect_DyHead, [nc, 1024, 3]]  # Detect(P3, P4, P5)

#   - [[33, 38, 43,48], 1, Detect, [nc]]  # Detect(P3, P4, P5)

#   - [[26, 29, 32,35],1, Detect_DyHead, [nc, 1024, 3]]  # Detect(P3, P4, P5)